kepler-444b/GD_gd32e230c8t6/Source/device/panel_key.c
static void process_panel_adc(panel_status_t *panel_status, common_panel_t *common_panel, adc_value_t *adc_value, bool is_ex)
{
    for (uint8_t i = 0; i < KEY_NUMBER_COUNT; i++) {
        if (adc_value->vol >= panel_status[i].vol_range.min && adc_value->vol <= panel_status[i].vol_range.max) {
            // 填充满buffer才会执行下面的代码
            adc_value->vol_buf[adc_value->buf_idx++] = adc_value->vol;
            if (adc_value->buf_idx >= ADC_VALUE_COUNT) {
                adc_value->buf_idx  = 0;
                adc_value->buf_full = 1;
                uint16_t new_value  = app_calculate_average(adc_value->vol_buf, ADC_VALUE_COUNT);
                if (new_value >= panel_status[i].vol_range.min && new_value <= panel_status[i].vol_range.max) {
                    if (panel_status[i].key_press == false) {
                        if (common_panel->enter_config == false) {
                            panel_status[i].key_status = !panel_status[i].key_status;
                            if (panel_status[i].relay_short != false) {
                                app_send_cmd(i, 0x00, PANEL_HEAD, CURTAIN_STOP, is_ex);
                            } else {
                                app_send_cmd(i, panel_status[i].key_status, PANEL_HEAD, 0x00, is_ex);
                            }
                            panel_status[i].key_press = true;
                        }
                        common_panel->key_long_press = true;
                        common_panel->key_long_count = 0;
                    } else if (common_panel->key_long_press == true) {
                        common_panel->key_long_count++;
                        if (common_panel->key_long_count >= 500) {
                            app_send_cmd(0, 0, APPLY_CONFIG, 0x00, is_ex);
                            common_panel->key_long_press = false;
                        }
                    }
                }
            }
        } else if (adc_value->vol >= DEFAULT_MIN_VALUE && adc_value->vol <= DEFAULT_MAX_VALUE) {
            panel_status[i].key_press    = false;
            common_panel->key_long_press = false;
            common_panel->key_long_count = 0;
        }
    }
}

static void process_led_flicker(common_panel_t *common_panel, bool is_ex_panel)
{
    common_panel->led_filck_count++;
    if (common_panel->led_filck_count <= 500) {
        panel_ctrl_led_all(false, is_ex_panel);
    } else if (common_panel->led_filck_count <= 1000) {
        panel_ctrl_led_all(true, is_ex_panel);
    } else if (common_panel->led_filck_count <= 1500) {
        panel_ctrl_led_all(false, is_ex_panel);
    } else {
        common_panel->led_filck_count = 0;
        common_panel->led_filck       = false;
        panel_ctrl_led_all(true, is_ex_panel);
    }
}

static void panel_proce_cmd(TimerHandle_t xTimer)
{
    const panel_cfg_t *temp_cfg = app_get_panel_cfg();
    process_exe_status(temp_cfg, my_panel_status);
#if defined PANEL_8KEY
    const panel_cfg_t *temp_cfg_ex = app_get_panel_cfg_ex();
    process_exe_status(temp_cfg_ex, my_panel_status_ex);

#endif
}

static void process_exe_status(const panel_cfg_t *temp_cfg, panel_status_t *temp_status)
{
    for (uint8_t i = 0; i < KEY_NUMBER_COUNT; i++) {

        if (temp_status[i].led_w_short) { // led 短亮
            if (temp_status[i].led_w_short_count == 0) {
                temp_status[i].led_w_open = true;
            }
            temp_status[i].led_w_short_count++;
            if (temp_status[i].led_w_short_count >= SHORT_TIME_LED) {
                temp_status[i].led_w_open        = false;
                temp_status[i].led_w_short       = false;
                temp_status[i].led_w_short_count = 0;
            }
        }

        if (temp_status[i].relay_short == true) { // 继电器导通30s
            if (temp_status[i].relay_open_count == 0) {
                temp_status[i].relay_open = true;
            }
            temp_status[i].relay_open_count++;
            if (temp_status[i].relay_open_count >= SHORT_TIME_RELAY) {
                temp_status[i].relay_open       = false;
                temp_status[i].relay_short      = false;
                temp_status[i].led_w_open       = false;
                temp_status[i].key_status       = false;
                temp_status[i].relay_open_count = 0;
            }
        }

        if (temp_status[i].led_w_open != temp_status[i].led_w_last) { // 开关led
            APP_SET_GPIO(temp_cfg[i].led_w_pin, temp_status[i].led_w_open);
            if (temp_status[i].led_w_open == true) {
                app_set_pwm_fade(temp_cfg[i].led_y_pin, 0, 1000);
            } else if (temp_status[i].led_w_open == false) {
                app_set_pwm_fade(temp_cfg[i].led_y_pin, 500, 1000);
            }
            temp_status[i].led_w_last = temp_status[i].led_w_open;
            panel_check_key_status(); // 每次led变化后都会检测一次
        }

        if (temp_status[i].led_y_open != temp_status[i].led_y_last) {
            if (temp_status[i].led_y_open == true) {
                app_set_pwm_fade(temp_cfg[i].led_y_pin, 500, 3000);
            } else if (temp_status[i].led_y_open == false) {
                app_set_pwm_fade(temp_cfg[i].led_y_pin, 0, 3000);
            }
            temp_status[i].led_y_last = temp_status[i].led_y_open;
        }

        if (temp_status[i].relay_open != temp_status[i].relay_last) { // 开关继电器
            // 开关该按键所控的所有继电器
            APP_SET_GPIO(temp_cfg[i].relay_pin[0], temp_status[i].relay_open);
            APP_SET_GPIO(temp_cfg[i].relay_pin[1], temp_status[i].relay_open);
            APP_SET_GPIO(temp_cfg[i].relay_pin[2], temp_status[i].relay_open);
            APP_SET_GPIO(temp_cfg[i].relay_pin[3], temp_status[i].relay_open);
            // APP_PRINTF("%d%d%d%d\n", APP_GET_GPIO(PB12), APP_GET_GPIO(PB13), APP_GET_GPIO(PB14), APP_GET_GPIO(PB15));
            temp_status[i].relay_last = temp_status[i].relay_open;

            temp_status[i].relay_open_count = 0;
        }
#if defined PANEL_6KEY // 6键面板与8键的背光灯开关逻辑不同,在此用宏定义隔开
        if (my_common_panel.back_status != my_common_panel.back_status_last) {
            if (my_common_panel.back_status == 0) {
                app_set_pwm_fade(PA8, 0, 3000);
            } else if (my_common_panel.back_status == 1) {
                app_set_pwm_fade(PA8, 500, 3000);
            } else if (my_common_panel.back_status == 2) {
                app_set_pwm_fade(PA8, 50, 3000);
            }
            my_common_panel.back_status_last = my_common_panel.back_status;
        }
#endif
    }
}

static void panel_check_key_status(void)
{
#if defined PANEL_6KEY
    uint8_t all_key_status = 0;
    for (uint8_t i = 0; i < KEY_NUMBER_COUNT; i++) {
        all_key_status += my_panel_status[i].key_status;
    }
    if (all_key_status == 0) {
        my_common_panel.back_status = 2;
    } else {
        my_common_panel.back_status = 1;
    }
#endif
}

static void panel_data_cb(valid_data_t *data)
{
    const panel_cfg_t *temp_cfg = app_get_panel_cfg();
    process_cmd_check(data, temp_cfg, my_panel_status);

#if defined PANEL_8KEY
    const panel_cfg_t *temp_cfg_ex = app_get_panel_cfg_ex();
    process_cmd_check(data, temp_cfg_ex, my_panel_status_ex);
#endif
}

