kepler-444b/GD_gd32e230c8t6/Source/device/panel_key.c
static void process_cmd_check(valid_data_t *data, const panel_cfg_t *temp_cfg, panel_status_t *temp_status)
{
    switch (data->data[1]) {

        case ALL_CLOSE: {
            for (uint8_t i = 0; i < KEY_NUMBER_COUNT; i++) {
                // 匹配"权限""总关区域"
                if ((temp_cfg[i].key_perm & 0x20) &&
                    ((data->data[4] >> 4 == temp_cfg[i].key_area >> 4) || data->data[4] >> 4 == 0xF)) {
                    switch (temp_cfg[i].key_func) {
                        case ALL_CLOSE:
                            panel_fast_exe(temp_status, i, (0b00001000 & ~0x01) | (data->data[2] & 0x01));
                            panel_fast_exe(temp_status, i, (0b10010010 & ~0x01) | (data->data[2] & 0x01));
                            break;
                        case NIGHT_LIGHT:
                        case DND_MODE:
                            panel_fast_exe(temp_status, i, (0b00010110 & ~0x01) | (data->data[2] & 0x01));
                            break;
                        case SCENE_MODE:
                        case LIGHT_MODE:
                        case ALL_ON_OFF:
                        case CLEAN_ROOM:
                            panel_fast_exe(temp_status, i, (0b00000000 & ~0x01) | (data->data[2] & 0x01));
                            break;
                        default:
                            break;
                    }
                }
            }
        } break;

        case ALL_ON_OFF: {
            for (uint8_t i = 0; i < KEY_NUMBER_COUNT; i++) {
                // 匹配"权限""总关区域"
                if ((temp_cfg[i].key_perm & 0x20) &&
                    ((data->data[4] >> 4 == temp_cfg[i].key_area >> 4) || data->data[4] >> 4 == 0xF)) {

                    switch (temp_cfg[i].key_func) {
                        case ALL_ON_OFF:
                            panel_fast_exe(temp_status, i, (0b10010110 & ~0x01) | (data->data[2] & 0x01));
                            break;
                        case NIGHT_LIGHT:
                        case DND_MODE:
                            panel_fast_exe(temp_status, i, (0b10010110 & ~0x01) | (~data->data[2] & 0x01));
                            break;
                        case SCENE_MODE:
                        case LIGHT_MODE:
                        case CLEAN_ROOM:
                            panel_fast_exe(temp_status, i, (0b10010110 & ~0x01) | (data->data[2] & 0x01));
                            break;
                        case ALL_CLOSE:
                            panel_fast_exe(temp_status, i, (0b00001000 & ~0x01) | (data->data[2] & 0x01));
                            panel_fast_exe(temp_status, i, (0b10010010 & ~0x01) | (data->data[2] & 0x01));
                            break;
                        default:
                            break;
                    }
                }
            }

        } break;
        case CLEAN_ROOM: {
            for (uint8_t i = 0; i < KEY_NUMBER_COUNT; i++) {
                if (temp_cfg[i].key_func == CLEAN_ROOM &&
                    (data->data[3] == temp_cfg[i].key_group || data->data[3] == 0xF)) {
                    panel_fast_exe(temp_status, i, (0b10010110 & ~0x01) | (data->data[2] & 0x01));
                    if (data->data[2] == true) {
                        for (uint8_t j = 0; j < KEY_NUMBER_COUNT; j++) {
                            if (temp_cfg[j].key_func == DND_MODE &&
                                (data->data[3] == temp_cfg[j].key_group || data->data[3] == 0xF)) {
                                panel_fast_exe(temp_status, j, (0b10010110 & ~0x01) | (~data->data[2] & 0x01));
                            }
                        }
                    }
                }
            }

        } break;
        case DND_MODE: {
            for (uint8_t i = 0; i < KEY_NUMBER_COUNT; i++) {
                if (temp_cfg[i].key_func == DND_MODE &&
                    (data->data[3] == temp_cfg[i].key_group || data->data[3] == 0xF)) {
                    panel_fast_exe(temp_status, i, (0b10010110 & ~0x01) | (data->data[2] & 0x01));
                    if (data->data[2] == true) {
                        for (uint8_t j = 0; j < KEY_NUMBER_COUNT; j++) {
                            if (temp_cfg[j].key_func == CLEAN_ROOM &&
                                (data->data[3] == temp_cfg[j].key_group || data->data[3] == 0xF)) {
                                panel_fast_exe(temp_status, j, (0b10010110 & ~0x01) | (~data->data[2] & 0x01));
                            }
                        }
                    }
                }
            }

        } break;
        case LATER_MODE: {
            for (uint8_t i = 0; i < KEY_NUMBER_COUNT; i++) {
                if (temp_cfg[i].key_func == LATER_MODE &&
                    (data->data[3] == temp_cfg[i].key_group || data->data[3] == 0xF)) {
                    panel_fast_exe(temp_status, i, (0b10100110 & ~0x01) | (data->data[2] & 0x01));
                }
            }

        } break;
        case CHECK_OUT: {
            for (uint8_t i = 0; i < KEY_NUMBER_COUNT; i++) {
                if (temp_cfg[i].key_func == CHECK_OUT &&
                    (data->data[3] == temp_cfg[i].key_group || data->data[3] == 0xF)) {
                    panel_fast_exe(temp_status, i, (0b10010110 & ~0x01) | (data->data[2] & 0x01));
                }
            }

        } break;
        case SOS_MODE: {
            for (uint8_t i = 0; i < KEY_NUMBER_COUNT; i++) {
                if (temp_cfg[i].key_func == data->data[1] &&
                    temp_cfg[i].key_group == data->data[3] &&
                    temp_cfg[i].key_group != 0x00) {
                    temp_status[i].led_w_open = data->data[2];
                    temp_status[i].relay_open = data->data[2];
                    temp_status[i].key_status = data->data[2];
                }
            }

        } break;
        case SERVICE: {
            for (uint8_t i = 0; i < KEY_NUMBER_COUNT; i++) {
                if (temp_cfg[i].key_func == data->data[1] &&
                    temp_cfg[i].key_group == data->data[3] &&
                    temp_cfg[i].key_group != 0x00) {
                    temp_status[i].led_w_open = data->data[2];
                    temp_status[i].relay_open = data->data[2];
                    temp_status[i].key_status = data->data[2];
                }
            }

