kepler-444b/GD_gd32e230c8t6/Source/device/panel_key.c
        } break;
        case CURTAIN_OPEN: {
            for (uint8_t i = 0; i < KEY_NUMBER_COUNT; i++) {
                // 检查功能匹配和分组匹配
                if (temp_cfg[i].key_func == data->data[1] &&
                    temp_cfg[i].key_group == data->data[3] &&
                    temp_cfg[i].key_group != 0x00) {
                    for (uint8_t j = 0; j < KEY_NUMBER_COUNT; j++) {
                        // 关闭同分组的"窗帘关"
                        if (temp_cfg[j].key_func == CURTAIN_CLOSE &&
                            temp_cfg[j].key_group == data->data[3]) {
                            temp_status[j].relay_open  = false;
                            temp_status[j].relay_short = false;
                        }
                    }
                    temp_status[i].led_w_short = true; // 短亮
                    temp_status[i].relay_short = true; // 继电器导通 30s
                }
            }
        } break;
        case CURTAIN_CLOSE: {
            for (uint8_t i = 0; i < KEY_NUMBER_COUNT; i++) {
                // 检查功能匹配和分组匹配
                if (temp_cfg[i].key_func == data->data[1] &&
                    temp_cfg[i].key_group == data->data[3] &&
                    temp_cfg[i].key_group != 0x00) {
                    for (uint8_t j = 0; j < KEY_NUMBER_COUNT; j++) {
                        // 关闭同分组的"窗帘开"
                        if (temp_cfg[j].key_func == CURTAIN_OPEN &&
                            temp_cfg[j].key_group == data->data[3]) {
                            temp_status[j].relay_open  = false;
                            temp_status[j].relay_short = false;
                        }
                    }
                    temp_status[i].led_w_short = true;
                    temp_status[i].relay_short = true;
                }
            }
        } break;

        case SCENE_MODE: {
            for (uint8_t i = 0; i < KEY_NUMBER_COUNT; i++) {

                if ((((temp_cfg[i].key_area & NIGHT_LIGHT) == (data->data[4] & NIGHT_LIGHT)) ||
                     ((data->data[4] & NIGHT_LIGHT) == 0xF)) &&
                    (temp_cfg[i].key_func == data->data[1])) {          // 匹配"场景区域"(若为0xF则可以控制所有场景区域)和"按键功能"
                    if (temp_cfg[i].key_scene_group == data->data[7]) { // 匹配"场景分组"
                        for (uint8_t j = 0; j < KEY_NUMBER_COUNT; j++) {
                            if (temp_cfg[j].key_func == SCENE_MODE &&
                                (((temp_cfg[j].key_area & NIGHT_LIGHT) == (data->data[4] & NIGHT_LIGHT)) ||
                                 ((data->data[4] & NIGHT_LIGHT) == 0xF))) { // 关闭同"场景区域"的其他分组
                                temp_status[j].led_w_open = false;
                                temp_status[j].relay_open = false;
                                temp_status[j].key_status = false;
                            }
                        }
                        temp_status[i].led_w_open = data->data[2];
                        temp_status[i].relay_open = data->data[2];
                        temp_status[i].key_status = data->data[2];
                    }
                }
            }

        } break;
        case LIGHT_MODE: {
            for (uint8_t i = 0; i < KEY_NUMBER_COUNT; i++) {
                if (temp_cfg[i].key_func == data->data[1] &&
                    temp_cfg[i].key_group == data->data[3] &&
                    temp_cfg[i].key_group != 0x00) {

                    temp_status[i].led_w_open = data->data[2];
                    temp_status[i].relay_open = data->data[2];
                    temp_status[i].key_status = data->data[2];
                }
            }

        } break;
        case NIGHT_LIGHT: {
            for (uint8_t i = 0; i < KEY_NUMBER_COUNT; i++) {
                if (temp_cfg[i].key_func == data->data[1] &&
                    temp_cfg[i].key_group == data->data[3] &&
                    temp_cfg[i].key_group != 0x00) {
                    temp_status[i].led_w_open = data->data[2];
                    temp_status[i].relay_open = data->data[2];
                    temp_status[i].key_status = data->data[2];
                }
            }

        } break;
        case LIGHT_UP:
            break;
        case LIGHT_DOWN:
            break;
        case DIMMING_3:
            break;
        case DIMMING_4:
            break;
        case UNLOCKING:
            break;
        case BLUETOOTH:
            break;
        case CURTAIN_STOP: {
            for (uint8_t i = 0; i < KEY_NUMBER_COUNT; i++) {
                if (temp_cfg[i].key_group == data->data[3] &&
                    temp_cfg[i].key_group != 0x00 &&
                    temp_status[i].relay_short == true) { // 匹配分组后如果该继电器正在动作才能触发暂停
                    temp_status[i].led_w_short = true;
                    temp_status[i].relay_short = false;
                    temp_status[i].relay_open  = false;
                }
            }
        } break;
        case VOLUME_ADD:
            break;
        case VOLUME_SUB:
            break;
        case PLAY_PAUSE:
            break;
        case NEXT_SONG:
            break;
        case LAST_SONG:
            break;
        default:
            return;
    }
}

static void panel_ctrl_led_all(bool led_state, bool is_ex)
{
    panel_status_t *temp = NULL;
#ifndef PANEL_8KEY
    temp = my_panel_status;
#endif
#if defined PANEL_8KEY
    temp = is_ex ? my_panel_status_ex : my_panel_status;
#endif
    for (uint8_t i = 0; i < KEY_NUMBER_COUNT; i++) {
        temp[i].led_w_open = led_state;
    }
}

static void panel_event_handler(event_type_e event, void *params)
{
    switch (event) {
        case EVENT_ENTER_CONFIG: {
            panel_ctrl_led_all(true, false);
            my_common_panel.enter_config = true;
        } break;
        case EVENT_EXIT_CONFIG: {
            panel_ctrl_led_all(false, false);
            my_common_panel.enter_config = false;
            NVIC_SystemReset(); // 退出"配置模式"后触发软件复位
        } break;
        case EVENT_SAVE_SUCCESS: {
            my_common_panel.led_filck = true;
        } break;
#if defined PANEL_8KEY
        case EVENT_ENTER_CONFIG_EX:
            panel_ctrl_led_all(true, true);
            my_common_panel_ex.enter_config = true;
            break;
        case EVENT_EXIT_CONFIG_EX: {
            panel_ctrl_led_all(false, true);
            my_common_panel_ex.enter_config = false;
            NVIC_SystemReset();
        } break;
        case EVENT_SAVE_SUCCESS_EX: {
            my_common_panel_ex.led_filck = true;
        } break;
#endif
        case EVENT_RECEIVE_CMD: {
            valid_data_t *valid_data = (valid_data_t *)params;
            panel_data_cb(valid_data);
        } break;
        default:
            return;
    }
}

// 执行上电参数(迎宾)
static void panel_power_status(void)
{
    const panel_cfg_t *temp_cfg = app_get_panel_cfg();

    for (uint8_t i = 0; i < KEY_NUMBER_COUNT; i++) {
        if (temp_cfg[i].key_perm & 0x08) { // 权限是否勾选"迎宾"
            my_panel_status[i].led_w_open = true;
            my_panel_status[i].relay_open = true;
            my_panel_status[i].key_status = true;
        }
    }
#if defined PANEL_8KEY
    const panel_cfg_t *temp_cfg_ex = app_get_panel_cfg_ex();
    for (uint8_t i = 0; i < KEY_NUMBER_COUNT; i++) {
        if (temp_cfg_ex[i].key_perm & 0x08) { // 权限是否勾选"迎宾"
            my_panel_status_ex[i].led_w_open = true;
            my_panel_status_ex[i].relay_open = true;
            my_panel_status_ex[i].key_status = true;
        }
    }
#endif
}

static void panel_fast_exe(panel_status_t *temp_fast, uint8_t count, uint8_t flag)
{
    // 0位:data->data[2];1位:key_status;2位:led_w_open,3位:led_w_short
    // 4位:relay_open;5位:relay_short;6位:保留;7位:是否受data->data[2]控制

    if (BIT7(flag) == true) {
        if (BIT1(flag) == true) {
            temp_fast[count].key_status = BIT0(flag);
        }
        if (BIT2(flag) == true) {
            temp_fast[count].led_w_open = BIT0(flag);
        }
        if (BIT3(flag) == true) {
            temp_fast[count].led_w_short = BIT0(flag);
        }
        if (BIT4(flag) == true) {
            temp_fast[count].relay_open = BIT0(flag);
        }
        if (BIT5(flag) == true) {
            temp_fast[count].relay_short = BIT0(flag);
        }
    } else if (BIT7(flag) == false) {
        temp_fast[count].key_status  = BIT1(flag);
        temp_fast[count].led_w_open  = BIT2(flag);
        temp_fast[count].led_w_short = BIT3(flag);
        temp_fast[count].relay_open  = BIT4(flag);
        temp_fast[count].relay_short = BIT5(flag);
    }
}
#endif